application/app/Repositories/ObjectiveRepository.php

select * from `objectives`
---
    public function getAll() {
        return $this->objectives->get();

insert into `objectives` (`name`, `description`, `module`, `target_value`, `user_id`, `franchise_id`, `start_date`, `end_date`, `status`, `updated_at`, `created_at`) values ('adsads', 'adsads', 'leads', '22', '', '', '2023-10-03 09:51:12', '2023-10-31 09:51:12', 'active', '2023-10-17 09:51:12', '2023-10-17 09:51:12')
---
    public function create($data) {
        // Carga el nuevo Objetivo
        $objective = new $this->objectives;
        $objective->name = $data['name'];
        $objective->description = $data['description'];
        $objective->module = $data['module'];
        $objective->module_target = $data['module_target'];
        $objective->target_value = $data['target_value'];
        $objective->user_id = $data['user_id'];
        $objective->franchise_id = $data['franchise_id'];

        // Descomponemos el rango de fechas en fechas individuales
        $date_range = explode(' - ', $data['date_range']);
        $objective->start_date = Carbon::createFromFormat('m/d/Y', $date_range[0]);
        $objective->end_date = Carbon::createFromFormat('m/d/Y', $date_range[1]);

        // Calcula el estado (active o inactive) en función de la fecha actual
        $today = now();

        if ($today >= $objective->start_date && $today <= $objective->end_date) {
            $objective->status = 'active';
        } else {
            $objective->status = 'inactive';
        }

        // Guarda y retorna un booleano
        return $objective->save();